/***********************************************/
/* File Name : SV_def.c	 	         									   */
/*	Summary   : パラメータの初期値                    */
/*	Date      : 2023/03/16										            */
/*																	                        	   */
/*	Copyright(c) 2023 Tokyo Keiso Co.Ltd.				   */
/*			All rights reserved															        */
/***********************************************/

#include "SV_def.h"

/************************************************************/
/*	パラメータの初期値								                                   	*/
/*	※パラメータ定義(SV_def.h)と合わせること									                  */
/************************************************************/
stSVD SVD[CH_NUMMAX];

stSVD SVD_default={
  /*****             *****/
  /***   ユーザパラメータ   ***/
  /*****             *****/
		2000,		/*フルスケール*/
		3,			/*フルスケール小数点位置、単位*/
		0,			/*検出器サイズの設定*/
		1000,		/*Kファクタ*/		/*1000で1.000を表す*/
		0,			/*流量検出ダンピング設定*/	/*2で0.2を表す*/
		20,			/*ローカットの設定*/		/*20で2.0を表す*/
		0x0000,		/*バーンアウト(2byte)*/
		0,			/*バーンアウト指定入力値*/
		100,		/*動粘度(水)*/				/*100で1.00を表す*/
		0,			/*動粘度自動演算選択*/
		3,			/*エラーホールドタイム*/
		30,			/*逆流判定時間*/		/*30で3.0を表す*/
		-10,		/*逆流判定しきい値*/
		
		/*予約[64]	*/
		{0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000},
		
  /*****             *****/
  /***   メーカパラメータ    ***/
  /*****             *****/
		600,		/*駆動周波数*/
		8,			/*ドライブパルス数*/
		1,			/*相関値サーチ機能*/
		1,			/*ゲイン制御ステップ幅*/
		0,			/*音速フィルタ時定数*/
		5,			/*FIFO CH 初期値*/
		0,			/*音速固定・測定切替*/
		1500,		/*音速固定値*/
		30,			/*異常ホールド時間選択*/	/*30で0.30を表す*/
		20,			/*CUnet 再送信待機時間*/
		30,			/*受波検出閾値*/
		15,			/*波形アンバランス検出閾値*/
		94,			/*波形飽和検出閾値*/
		80,			/*差分相関比閾値*/				/*80で8.0を表す*/
		100,		/*演算異常判定回数*/
		10,			/*波形減衰閾値*/
		20,			/*受波検出警告閾値*/
		3,			/*アンプゲイン警告閾値*/
		3,			/*アンプゲイン警告ｶｳﾝﾄ*/
		0,			/*警告出力時間*/
		4000,		/*ゼロ点オフセット*/
		2,   /*フィルタモード(0:移動平均 1:フィルタなし 2:メディアンフィルタ*/	
		18,  /*移動平均数(1-50)*/	
		0,			/*薬液リニアライズモード選択*/
		0,			/*薬液リニアライズモード・薬液種別*/
		0,   /*積算オフセット値(ON/OFF)*/
		0,   /*積算オフセット値(設定値)*/
		0, 		/*調整モード*/
		100, /*サーチ開始周波数*/
		500, /*サーチ停止周波数*/
#if defined(FRQSCH)
		2000, /* サーチして得た周波数 */
#endif
		0x0000,			/*積算目標値*/
		0,			/*気泡対策モード*/
		1,			/*D Rate Limit ダンピング倍率*/
		3,			/*D Rate Limit ホールドクリア*//*3で0.3を表す*/
		100,		/*d[mm]/D Rate limit 1st*/		/*100で1.00を表す*/
		3,			/*D Rate limit 1st 目標*/		/*3で0.03を表す*/	
		1,			/*D Rate limit 1st 平均*/
		100,		/*l[mm]/D Rate limit 2nd*/		/*100で1.00を表す*/
		3,			/*D Rate limit 2nd 目標*/		/*3で0.03を表す*/
		1,			/*D Rate limit 2nd 平均*/
		100,		/*レートリミット*/			/*100で1.00を表す*/
		1,			/*可変ダンピング偏差値*/
		100,		/*可変ダンピング倍率*/		/*100で1.00を表す*/
		0,			/*異常ホールド時間*/		/*30で0.30を表す*/
		2550000,	/*相関値幅上限値*/
		1000,		/*相関値幅下限値*/


//評価用
		2,   //ADCクロック
		0,			//センサオプション
		600,  //センサ間距離(L)
		600,  //センサ間距離(L-l)
		6000, //無駄時間
		10000, //互換係数
		11,    //WINDOWオフセット
		20,   //差分相関開始位置
		21,  //差分相関終了位置
		1,    //差分相関間隔
		0,    //固定値設定
		0,    //Wiper Position(ゲイン値)
		0,    //FIFO CH
		0,    //Leading Position
		0,    //Zero Cross Start point
		12,    //Zero Cross Use Number
		{0,0,0,0,0,0,0},	//ゼロクロスゼロ点オフセット
		0,		//波形認識ピーク位置
		0,		//波形認識ピーク位置(ゼロクロス計算開始位置用)
//評価用		

#if defined(FRQSCH)
		/*予約[47]	*/
		{0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 },
#else
		/*予約[48]	*/
		{0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 },
#endif

  /*****             *****/
		/***   メーカリニアライズ   ***/
  /*****             *****/
		0x0000,		/*補正点数*/
		0x0000,		/*折線出力1(m/sec)*/
		0x0000,		/*折線出力2(m/sec)*/
		0x0000,		/*折線出力3(m/sec)*/
		0x0000,		/*折線出力4(m/sec)*/
		0x0000,		/*折線出力5(m/sec)*/
		0x0000,		/*折線出力6(m/sec)*/
		0x0000,		/*折線出力7(m/sec)*/
		0x0000,		/*折線出力8(m/sec)*/
		0x0000,		/*折線出力9(m/sec)*/
		0x0000,		/*折線出力10(m/sec)*/
		0x0000,		/*折線出力11(m/sec)*/
		0x0000,		/*折線出力12(m/sec)*/
		0x0000,		/*折線出力13(m/sec)*/
		0x0000,		/*折線出力14(m/sec)*/
		0x0000,		/*折線出力15(m/sec)*/
		0x0000,		/*折線入力1(m/sec)*/
		0x0000,		/*折線入力2(m/sec)*/
		0x0000,		/*折線入力3(m/sec)*/
		0x0000,		/*折線入力4(m/sec)*/
		0x0000,		/*折線入力5(m/sec)*/
		0x0000,		/*折線入力6(m/sec)*/
		0x0000,		/*折線入力7(m/sec)*/
		0x0000,		/*折線入力8(m/sec)*/
		0x0000,		/*折線入力9(m/sec)*/
		0x0000,		/*折線入力10(m/sec)*/
		0x0000,		/*折線入力11(m/sec)*/
		0x0000,		/*折線入力12(m/sec)*/
		0x0000,		/*折線入力13(m/sec)*/
		0x0000,		/*折線入力14(m/sec)*/
		0x0000,		/*折線入力15(m/sec)*/
	
  /*****             *****/
		/***  ユーザリニアライズ   ***/
  /*****             *****/
		0x0002,		/*補正点数、小数点位置(2byte)*/
		0x0000,		/*折線出力1(mL/min)*/
		0x0000,		/*折線出力2(mL/min)*/
		0x0000,		/*折線出力3(mL/min)*/
		0x0000,		/*折線出力4(mL/min)*/
		0x0000,		/*折線出力5(mL/min)*/
		0x0000,		/*折線出力6(mL/min)*/
		0x0000,		/*折線出力7(mL/min)*/
		0x0000,		/*折線出力8(mL/min)*/
		0x0000,		/*折線出力9(mL/min)*/
		0x0000,		/*折線出力10(mL/min)*/
		0x0000,		/*折線出力11(mL/min)*/
		0x0000,		/*折線出力12(mL/min)*/
		0x0000,		/*折線出力13(mL/min)*/
		0x0000,		/*折線出力14(mL/min)*/
		0x0000,		/*折線出力15(mL/min)*/
		0x0000,		/*折線入力1(mL/min)*/
		0x0000,		/*折線入力2(mL/min)*/
		0x0000,		/*折線入力3(mL/min)*/
		0x0000,		/*折線入力4(mL/min)*/
		0x0000,		/*折線入力5(mL/min)*/
		0x0000,		/*折線入力6(mL/min)*/
		0x0000,		/*折線入力7(mL/min)*/
		0x0000,		/*折線入力8(mL/min)*/
		0x0000,		/*折線入力9(mL/min)*/
		0x0000,		/*折線入力10(mL/min)*/
		0x0000,		/*折線入力11(mL/min)*/
		0x0000,		/*折線入力12(mL/min)*/
		0x0000,		/*折線入力13(mL/min)*/
		0x0000,		/*折線入力14(mL/min)*/
		0x0000,		/*折線入力15(mL/min)*/

  /*****                  *****/
		/***   ゼロ点調整時ステータス   ***/
  /*****                  *****/
		0x0000,		/*ゼロ点調整時：流量*/
		0x0000,		/*ゼロ点調整時：流速*/
		1500,		/*ゼロ点調整時：音速*/
		0x0000,		/*ゼロ点調整時：積算値*/
		0x0000,		/*ゼロ点調整時：受波波形最大値*/
		0x0000,		/*ゼロ点調整時：受波波形最小値*/
		0x0000,		/*ゼロ点調整時：伝搬時間差*/
		0x0000,		/*ゼロ点調整時：相関値幅*/
		4000,		/*ゼロ点調整時：ゼロ点オフセット*/
		0x0000,		/*ゼロ点調整時：コンディション*/
		0x0000,		/*ゼロ点調整時：FIFO受波波形検出位置*/
		0x0000,		/*ゼロ点調整時：アンプゲイン値(1st)*/
		0x0000,		/*ゼロ点調整時：アンプゲイン値(2nd)*/
		0x0000,		/*ゼロ点調整時：FIFO CH*/
		0x0000,		/*ゼロ点調整時：受波の差(P1-P2)*/
		{0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,		/*ゼロ点調整時：差分相関値[40]*/
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000},

  /*****            *****/
  /***   エラーログ関連   ***/
  /*****            *****/
		0,			/*起動回数*/
		{0,0,0,0,0,0,0,0,0,0},  /*エラーコード（最新10点）*/
		{0,0,0,0,0,0,0,0,0,0},		/*エラー発生時の電源オンカウンタ（最新10点）*/
		{0,0,0,0,0,0,0,0,0,0},		/*エラー発生時の時間（最新10点）*/
		
  /*****         *****/
  /***   通信関連   ***/
  /*****         *****/
		0,			/*サイレントインターバル*/
		0,			/*通信スピード*/
		0,			/*通信モード*/
		0,			/*パリティ*/
		0x0000,		/*サイレントインターバル(2byte)*/
		0x0100,		/*通信モード、パリティ(2byte)*/
		
  /*****                    *****/
  /***   バージョン、シリアルナンバー  ***/
  /*****                    *****/
		0x0000,		/*ソフトウェアバージョン*/
		0x0000,		/*ハードウェアバージョン*/
		{0x2020,0x2020,0x2020,0x2020,		/*変換器シリアルナンバー[8]*/
		 0x2020,0x2020,0x2020,0x2020},
		{0x2020,0x2020,0x2020,0x2020,		/*センサシリアルナンバー[8]*/
		 0x2020,0x2020,0x2020,0x2020},

		/*予約[32]	*/
		{0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,
		 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000},
};
