/***********************************************/
/* File Name : version.h		         									   */
/*	Summary   : バージョン情報定義                   */
/*	Date      : 2023/03/16										            */
/*																	                        	   */
/*	Copyright(c) 2023 Tokyo Keiso Co.Ltd.				   */
/*			All rights rederved															        */
/***********************************************/

/********************************************************/
/*	バージョン定義										*/
/********************************************************/
#if defined(FPGADOWNLOAD)
// #define		SOFT_VERSION	0xB200		//ファームウェアバージョン(FPGAダウンロードあり)
#define		SOFT_VERSION	0xD207		//ファームウェアバージョン(流量突出改善)
#else
#define     SOFT_VERSION    0xA207      //ファームウェアバージョン(FPGAダウンロードなし)
#endif
#define		HARD_VERSION	0x9100		//ハードウェアバージョン

/********************************************************/
/*	書込みフラグ定義									*/
/*	※書込みフラグの値がEEPROM上の値と異なる場合は		*/
/*	　EEPROMに対して、RAMクリアと初期値を読み込む		*/
/********************************************************/
#define		EEPROM_WRITE_FLAG	0x6000		//書込みフラグ

/********************************************************/
/*	通信タイプ定義										*/
/********************************************************/
#define		COM_RS485			0x1000		//RS485通信
#define		COM_CUNET			0x2000		//CUnet通信
